# Repaso Pyhton

## Listas

In [1]:
#listas

l = ["Juan",'Pedro', "Manuel","Ana","Rocio","Andrea"]

print(l[2:4])
print()

for i in iter(l):
    print(i)
print()

for j in range(len(l)):
    print(l[j])
print()

for x in enumerate(l):
    print(x)


print()
r=[j for j in enumerate(l)]
r[0]

['Manuel', 'Ana']

Juan
Pedro
Manuel
Ana
Rocio
Andrea

Juan
Pedro
Manuel
Ana
Rocio
Andrea

(0, 'Juan')
(1, 'Pedro')
(2, 'Manuel')
(3, 'Ana')
(4, 'Rocio')
(5, 'Andrea')

(0, 'Juan')

## Listas de comprensión:

La listas de comprensión, del inglés list comprehensions, es una funcionalidad que le permite crear listas avanzadas en una misma línea de código.

La forma general de la definición de una lista por comprensión es:

```
[expresion for item in iterable]
```
Opcionalmente, se puede incluir un condicional en la expresión:

```
[expresion for item in iterable if condicion]
```

expresion puede ser cualquier expresión computable en Python, generalmente involucrando un item del iterable llamado iterable puede ser cualquier objeto iterable, como una secuencia (lista o cadena de caracteres), la función la función range(), etc.

La salida siempre es un tipo de lista Python.

**Ejemplo 01**

Si requiere crear una lista de 4 elementos y cada elemento calcularle la potencia de 2, usando el método tradicional, eso seria así:

In [2]:
lista = []
for i in range(4):
    lista.append(i**2)

print("Tradicional")
print(lista)
#####################################


print()
print("Compresive list")
lista = [i**2 for i in range (4)]
print(lista)
print()

########################################

# A partir de otras listas..... 

new_lista = [i/2 for i in lista]
print("new lista")
print(new_lista)

Tradicional
[0, 1, 4, 9]

Compresive list
[0, 1, 4, 9]

new lista
[0.0, 0.5, 2.0, 4.5]

**Ejemplo**

A continuación se crear una lista con las potencias de 2 de los primeros 10 números

In [3]:
potencia = [i**2 for i in range(0,11)]
potencia

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

A continuación se crear una lista con los todos los múltiples de 2 de la lista potencia:

In [4]:
potencia_pares = [numero for numero in potencia if numero % 2 == 0 ]
potencia_pares

[0, 4, 16, 36, 64, 100]

Lo podemos hacer todo junto

In [5]:
L2 = [numero for numero in [numero**2 for numero in range(0,11) if numero %2 ==0]]

L2

[0, 4, 16, 36, 64, 100]

In [6]:
potencia_pares_2 = [numero/2 for numero in potencia if numero % 2 == 0 ]
potencia_pares_2


print()
l = ["Juan",'Pedro', "Manuel","Ana","Rocio","Andrea"]
for j in enumerate(l):
    print(j)


print()

r=[j for j in enumerate(l)]
r

(0, 'Juan')
(1, 'Pedro')
(2, 'Manuel')
(3, 'Ana')
(4, 'Rocio')
(5, 'Andrea')

[(0, 'Juan'),
 (1, 'Pedro'),
 (2, 'Manuel'),
 (3, 'Ana'),
 (4, 'Rocio'),
 (5, 'Andrea')]

## Definición de Lambda

En Python, una función Lambda se refiere a una pequeña función anónima. Las llamamos “funciones anónimas” porque técnicamente carecen de nombre.
Al contrario que una función normal, no la definimos con la palabra clave estándar def que utilizamos en Python. En su lugar, las funciones Lambda se definen como una línea que ejecuta una sola expresión. Este tipo de funciones pueden tomar cualquier número de argumentos, pero solo pueden tener una expresión.

Sintaxis básica

Todas las funciones Lambda en Python tienen exactamente la misma sintaxis:

```
#Escribo p1 y p2 como parámetros 1 y 2 de la función.
lambda p1, p2: expresión 
```

Como mejor te lo puedo explicar es enseñándote un ejemplo básico, vamos a ver una función normal y un ejemplo de Lambda:

In [7]:
#Aquí tenemos una función creada para sumar.
def suma(x,y):
    return(x + y)

#Aquí tenemos una función Lambda que también suma.
lambda x,y : x + y

#Para poder utilizarla necesitamos guardarla en una variable.
suma_dos = lambda x,y : x + y


print("función suma.................",suma(2,2))
print("función suma lambda..........",suma_dos(2,2))

función suma................. 4
función suma lambda.......... 4

Al igual que ocurre en las list comprehensions, lo que hemos hecho es escribir el código en una sola línea y limpiar la sintaxis innecesaria.

En lugar de usar def para definir nuestra función, hemos utilizado la palabra clave lambda; a continuación escribimos x, y como argumentos de la función, y x + y como expresión. Además, se omite la palabra clave return, condensando aún más la sintaxis.

Por último, y aunque la definición es anónima, la almacenamos en la variable suma_dos para poder llamarla desde cualquier parte del código, de no ser así tan solo podríamos hacer uso de ella en la línea donde la definamos

Otro ejemplos

In [8]:
impar = lambda numero: numero%2 != 0
num = input()
print("es impar....",impar(int(num)))

 1011

es impar.... True

## Lambda en listas con el método filter()

La función filter() es capaz de devolver una nueva colección con los elementos filtrados que cumplan una condición.

Podemos comprobar, por ejemplo, cuales son los números pares de una lista dada. Para ello le pasaremos una lista a una Lambda de la siguiente forma:

In [9]:
#Tengo una lista con muchos números
comprobar = [38,24,99,42,2,3,11,23,53,21,3,53,77,12,34,92,122,1008,26,1023,1203578]

#Creo una variable y le aplico filter() y la lambda
filt = filter(lambda x: x % 2 == 0, comprobar)

#Creo una variable para convertir el resultado de 'filt' en una lista 
pares = list(filt)

#Finalmente obtengo la lista con los resultados que han devuelto True al pasar el filtro
print(pares)

[38, 24, 42, 2, 12, 34, 92, 122, 1008, 26, 1203578]

# Crear un Data Frame desde un Diccionario de Pandas

In [10]:
import pandas as pd
import numpy as np

# Creamos el Diccionario
elementos = {
    "Numero atómico" : [1, 6, 47, 88],
    "Masa atómica"  : [1.008,12.011,107.87, 226],
    "Familia"        : ["No metal",'No metal', "Metal","Metal"]
}
print(elementos)
print()
# Creamos el Data Frame

tabla_periodica = pd.DataFrame(elementos)
tabla_periodica

{'Numero atómico': [1, 6, 47, 88], 'Masa atómica': [1.008, 12.011, 107.87, 226], 'Familia': ['No metal', 'No metal', 'Metal', 'Metal']}

   Numero atómico  Masa atómica   Familia
0               1         1.008  No metal
1               6        12.011  No metal
2              47       107.870     Metal
3              88       226.000     Metal

## También

In [11]:
tabla_periodica = pd.DataFrame(
    elementos,
    index = ['H','C','Ag','Ra'],
    columns = ['Familia',"Numero atómico","Masa atómica"]
)

tabla_periodica

     Familia  Numero atómico  Masa atómica
H   No metal               1         1.008
C   No metal               6        12.011
Ag     Metal              47       107.870
Ra     Metal              88       226.000

## Creación de un dataframe a partir de una lista de diccionarios

In [12]:
unidades_2015 = {"Ag":2, "Au":5, "Cu":3, "Pt":2}
unidades_2016 = {"Ag":4, "Au":6, "Cu":7, "Pt":2}
unidades_2017 = {"Ag":3, "Au":2, "Cu":4, "Pt":1}


UNIDADES = [unidades_2015,unidades_2016,unidades_2017]
INDICES   = [2015,2016,2017]

unid = pd.DataFrame(UNIDADES,
                        index=INDICES)

unid

      Ag  Au  Cu  Pt
2015   2   5   3   2
2016   4   6   7   2
2017   3   2   4   1

Los diccionarios deberán compartir el mismo conjunto de claves que se interpretarán como etiquetas de columnas. Si las etiquetas no coinciden, se crearán todas las columnas pero se asignarán NaN a los valores desconocidos:

In [13]:
unidades_2015 = {"Ag":2, "Au":5, "Cu":3, "Pt":2}
unidades_2016 = {"Ag":4, "Au":6, "Cu":7, "Pt":2}
unidades_2017 = {"Ag":3, "Pb":2, "Cu":4, "Pt":1}

UNIDADES = [unidades_2015,unidades_2016,unidades_2017]
INDICES   = [2015,2016,2017]

unid = pd.DataFrame(UNIDADES,
                        index=INDICES)

unid

      Ag   Au  Cu  Pt   Pb
2015   2  5.0   3   2  NaN
2016   4  6.0   7   2  NaN
2017   3  NaN   4   1  2.0

## También: Convertir un diccionario básico en un DataFrame

In [14]:
clients = {
    "Waldon Astling": 1.83,
    "Catherine MacTerlagh": 0.15,
    "Gusty Wondraschek": 9.19,
    "Lois Vaan": 1.28,
    "Baird Eberts": 0.82,
    "Amalia Flieg": 2.88,
    "Leontine Wildbore": 9.44,
    "Rikki Chasteney": 7.01,
    "Augustine Papierz": 0.22,
    "Maynord Lawrance": 0.33
}

tabla_lista = [ [key, clients[key]] for key in clients.keys()]


df = pd.DataFrame(tabla_lista, columns=['Name', 'Amount'])
#df=df.set_index(["Name"])

df

                   Name  Amount
0        Waldon Astling    1.83
1  Catherine MacTerlagh    0.15
2     Gusty Wondraschek    9.19
3             Lois Vaan    1.28
4          Baird Eberts    0.82
5          Amalia Flieg    2.88
6     Leontine Wildbore    9.44
7       Rikki Chasteney    7.01
8     Augustine Papierz    0.22
9      Maynord Lawrance    0.33

In [15]:
[ [key, clients[key]] for key in clients.keys()]

[['Waldon Astling', 1.83],
 ['Catherine MacTerlagh', 0.15],
 ['Gusty Wondraschek', 9.19],
 ['Lois Vaan', 1.28],
 ['Baird Eberts', 0.82],
 ['Amalia Flieg', 2.88],
 ['Leontine Wildbore', 9.44],
 ['Rikki Chasteney', 7.01],
 ['Augustine Papierz', 0.22],
 ['Maynord Lawrance', 0.33]]

In [16]:
print(clients.keys())
print(clients.values())
print(clients['Waldon Astling'])
print()

for key in clients.keys():
    print(key,clients[key])

dict_keys(['Waldon Astling', 'Catherine MacTerlagh', 'Gusty Wondraschek', 'Lois Vaan', 'Baird Eberts', 'Amalia Flieg', 'Leontine Wildbore', 'Rikki Chasteney', 'Augustine Papierz', 'Maynord Lawrance'])
dict_values([1.83, 0.15, 9.19, 1.28, 0.82, 2.88, 9.44, 7.01, 0.22, 0.33])
1.83

Waldon Astling 1.83
Catherine MacTerlagh 0.15
Gusty Wondraschek 9.19
Lois Vaan 1.28
Baird Eberts 0.82
Amalia Flieg 2.88
Leontine Wildbore 9.44
Rikki Chasteney 7.01
Augustine Papierz 0.22
Maynord Lawrance 0.33

## Convertir un diccionario cuyo valor es otro diccionario.

Ahora se puede aumentar la apuesta, el valor del diccionario es otro diccionario. Por ejemplo, convertir el siguiente diccionario.

In [17]:
clients = {
    "Waldon Astling": {
        "id": 1,
        "email": "wastling0@dailymail.co.uk",
        "gender": "Male",
        "ip_address": "188.125.74.119",
        "money": 1.83
    },
    "Catherine MacTerlagh": {
        "id": 2,
        "email": "cmacterlagh1@wired.com",
        "gender": "Female",
        "ip_address": "142.102.151.95",
        "money": 0.15
    },
    "Gusty Wondraschek": {
        "id": 3,
        "email": "gwondraschek2@posterous.com",
        "gender": "Female",
        "ip_address": "25.253.221.98",
        "money": 9.19
    },
    "Lois Vaan": {
        "id": 4,
        "email": "lvaan3@imdb.com",
        "gender": "Female",
        "ip_address": "1.196.39.50",
        "money": 1.28
    },
    "Baird Eberts": {
        "id": 5,
        "email": "beberts4@irs.gov",
        "gender": "Male",
        "ip_address": "88.230.140.148",
        "money": 0.82
    },
    "Amalia Flieg": {
        "id": 6,
        "email": "aflieg5@mapy.cz",
        "gender": "Female",
        "ip_address": "203.219.142.196",
        "money": 2.88
    },
    "Leontine Wildbore": {
        "id": 7,
        "email": "lwildbore6@nps.gov",
        "gender": "Female",
        "ip_address": "255.74.26.131",
        "money": 9.44
    },
    "Rikki Chasteney": {
        "id": 8,
        "email": "rchasteney7@diigo.com",
        "gender": "Female",
        "ip_address": "90.29.53.76",
        "money": 7.01
    },
    "Augustine Papierz": {
        "id": 9,
        "email": "apapierz8@people.com.cn",
        "gender": "Female",
        "ip_address": "43.165.166.247",
        "money": 0.22
    },
    "Maynord Lawrance": {
        "id": 10,
        "email": "mlawrance9@redcross.org",
        "gender": "Male",
        "ip_address": "174.230.82.205",
        "money": 0.33
    }
}

In [18]:
df = pd.DataFrame([key for key in clients.keys()], columns=['Name'])

df['id']         = [value['id'] for value in clients.values()]
df['email']      = [value['email'] for value in clients.values()]
df['gender']     = [value['gender'] for value in clients.values()]
df['ip_address'] = [value['ip_address'] for value in clients.values()]
df['money']      = [value['money'] for value in clients.values()]
df

,Name,id,email,gender,ip_address,money
0,Waldon Astling,1,wastling0@dailymail.co.uk,Male,188.125.74.119,1.83
1,Catherine MacTerlagh,2,cmacterlagh1@wired.com,Female,142.102.151.95,0.15
2,Gusty Wondraschek,3,gwondraschek2@posterous.com,Female,25.253.221.98,9.19
3,Lois Vaan,4,lvaan3@imdb.com,Female,1.196.39.50,1.28
4,Baird Eberts,5,beberts4@irs.gov,Male,88.230.140.148,0.82
5,Amalia Flieg,6,aflieg5@mapy.cz,Female,203.219.142.196,2.88
6,Leontine Wildbore,7,lwildbore6@nps.gov,Female,255.74.26.131,9.44
7,Rikki Chasteney,8,rchasteney7@diigo.com,Female,90.29.53.76,7.01
8,Augustine Papierz,9,apapierz8@people.com.cn,Female,43.165.166.247,0.22
9,Maynord Lawrance,10,mlawrance9@redcross.org,Male,174.230.82.205,0.33

In [19]:
[value['id'] for value in clients.values()]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [20]:
print(clients.keys())
print()
print(clients.values())
print()
for values in clients.values():
    print(values['id'])

dict_keys(['Waldon Astling', 'Catherine MacTerlagh', 'Gusty Wondraschek', 'Lois Vaan', 'Baird Eberts', 'Amalia Flieg', 'Leontine Wildbore', 'Rikki Chasteney', 'Augustine Papierz', 'Maynord Lawrance'])

dict_values([{'id': 1, 'email': 'wastling0@dailymail.co.uk', 'gender': 'Male', 'ip_address': '188.125.74.119', 'money': 1.83}, {'id': 2, 'email': 'cmacterlagh1@wired.com', 'gender': 'Female', 'ip_address': '142.102.151.95', 'money': 0.15}, {'id': 3, 'email': 'gwondraschek2@posterous.com', 'gender': 'Female', 'ip_address': '25.253.221.98', 'money': 9.19}, {'id': 4, 'email': 'lvaan3@imdb.com', 'gender': 'Female', 'ip_address': '1.196.39.50', 'money': 1.28}, {'id': 5, 'email': 'beberts4@irs.gov', 'gender': 'Male', 'ip_address': '88.230.140.148', 'money': 0.82}, {'id': 6, 'email': 'aflieg5@mapy.cz', 'gender': 'Female', 'ip_address': '203.219.142.196', 'money': 2.88}, {'id': 7, 'email': 'lwildbore6@nps.gov', 'gender': 'Female', 'ip_address': '255.74.26.131', 'money': 9.44}, {'id': 8, 'email': 'rchasteney7@diigo.com', 'gender': 'Female', 'ip_address': '90.29.53.76', 'money': 7.01}, {'id': 9, 'email': 'apapierz8@people.com.cn', 'gender': 'Female', 'ip_address': '43.165.166.247', 'money': 0.22}, {'id': 10, 'email': 'mlawrance9@redcross.org', 'gender': 'Male', 'ip_address': '174.230.82.205', 'money': 0.33}])

1
2
3
4
5
6
7
8
9
10

# Reindex

In [21]:
df2 = df.set_index("Name")
df2

,id,email,gender,ip_address,money
Name,,,,,
Waldon Astling,1,wastling0@dailymail.co.uk,Male,188.125.74.119,1.83
Catherine MacTerlagh,2,cmacterlagh1@wired.com,Female,142.102.151.95,0.15
Gusty Wondraschek,3,gwondraschek2@posterous.com,Female,25.253.221.98,9.19
Lois Vaan,4,lvaan3@imdb.com,Female,1.196.39.50,1.28
Baird Eberts,5,beberts4@irs.gov,Male,88.230.140.148,0.82
Amalia Flieg,6,aflieg5@mapy.cz,Female,203.219.142.196,2.88
Leontine Wildbore,7,lwildbore6@nps.gov,Female,255.74.26.131,9.44
Rikki Chasteney,8,rchasteney7@diigo.com,Female,90.29.53.76,7.01
Augustine Papierz,9,apapierz8@people.com.cn,Female,43.165.166.247,0.22
Maynord Lawrance,10,mlawrance9@redcross.org,Male,174.230.82.205,0.33

## Multi-indexación
Hasta ahora hemos visto series y dataframes pandas con índices sencillos, pero pueden tener también índices jerárquicos o multi-índices, lo que abre la puerta a sofisticados procesos de manipulación y análisis de datos.

Podemos imaginarnos un multi-índice como un índice en el que cada valor es una tupla única de elementos. Es posible crear estos multi-índices y extraerlos posteriormente de varias formas.

**Creación de multi-índices**


**Podemos crear un multi-índice de cuatro formas distintas:**

* A partir de una lista de arrays, usando el método pd.MultiIndex.from_arrays()
* A partir de un array de tuplas, usando el método pd.MultiIndex.from_tuples()
* A partir del producto cartesiano de los valores de dos iterables, usando el método pd.MultiIndex.from_product()
* A partir de un DataFrame, usando el método pd.MultiIndex.from_frame()

Veamos un ejemplo de cada tipo.

In [22]:
index = pd.MultiIndex.from_arrays(
    [
        [2018, 2018, 2018, 2019, 2019, 2019],
        ["Spain", "Portugal", "France", "Spain", "Portugal", "France"]
    ],
    names = ["Year", "Country"]
)
index

MultiIndex([(2018,    'Spain'),
            (2018, 'Portugal'),
            (2018,   'France'),
            (2019,    'Spain'),
            (2019, 'Portugal'),
            (2019,   'France')],
           names=['Year', 'Country'])

In [23]:
valores =[18, 20, 10, 15, 12, 18]
data = pd.DataFrame(valores, index = index, columns = ["Sales"])
data

               Sales
Year Country
2018 Spain        18
     Portugal     20
     France       10
2019 Spain        15
     Portugal     12
     France       18

In [24]:
indice = [2019]


data.loc[indice]

               Sales
Year Country
2019 Spain        15
     Portugal     12
     France       18

## Multi-índices a partir de un array de tuplas

En este segundo método indicamos los valores del multi-índice valor por valor, siendo éstos tuplas:

In [25]:
index = pd.MultiIndex.from_tuples(
    [
    (2018, "Spain"),
    (2018, "Portugal"),
    (2018, "France"),
    (2019, "Spain"),
    (2019, "Portugal"),
    (2019, "France")
    ],
    names = ["Year", "Country"])
index

MultiIndex([(2018,    'Spain'),
            (2018, 'Portugal'),
            (2018,   'France'),
            (2019,    'Spain'),
            (2019, 'Portugal'),
            (2019,   'France')],
           names=['Year', 'Country'])

In [26]:
data = pd.DataFrame(valores, index = index, columns = ["Sales"])
data

               Sales
Year Country
2018 Spain        18
     Portugal     20
     France       10
2019 Spain        15
     Portugal     12
     France       18

## Multi-índices por producto cartesiano de arrays

El tercer método nos permite especificar los valores (únicos) de los diferentes niveles, creándose el índice jerárquico como resultado del producto escalar de los valores. Por ejemplo:

In [27]:
index = pd.MultiIndex.from_product(
    [
        [2018, 2019],
        ["Spain", "Portugal", "France"]
    ],
    names = ["Year", "Country"]
)
index

MultiIndex([(2018,    'Spain'),
            (2018, 'Portugal'),
            (2018,   'France'),
            (2019,    'Spain'),
            (2019, 'Portugal'),
            (2019,   'France')],
           names=['Year', 'Country'])

In [28]:
data = pd.DataFrame(valores, index = index, columns = ["Sales"])
data

               Sales
Year Country
2018 Spain        18
     Portugal     20
     France       10
2019 Spain        15
     Portugal     12
     France       18

## Multi-índices a partir de un DataFrame

Por último, podemos crear el multi-índice a partir de un DataFrame en el que cada columna coincide con una columna del multi-índice. Comencemos creando el DataFrame:

In [29]:
df = pd.DataFrame({
    "Year":[2018, 2018, 2018, 2019, 2019, 2019],
    "Country": ["Spain", "Portugal", "France", "Spain", "Portugal", "France"]
    })
df

   Year   Country
0  2018     Spain
1  2018  Portugal
2  2018    France
3  2019     Spain
4  2019  Portugal
5  2019    France

In [30]:
#creamos el indice 
index = pd.MultiIndex.from_frame(df)
index

MultiIndex([(2018,    'Spain'),
            (2018, 'Portugal'),
            (2018,   'France'),
            (2019,    'Spain'),
            (2019, 'Portugal'),
            (2019,   'France')],
           names=['Year', 'Country'])

In [31]:
data = pd.DataFrame(valores, index = index, columns = ["Sales"])
data

               Sales
Year Country
2018 Spain        18
     Portugal     20
     France       10
2019 Spain        15
     Portugal     12
     France       18

## Extracción de un nivel del índice

Trabajando con un DataFrame o una Serie pandas con multi-índice, es posible extraer los valores de un nivel del índice con el método .get_level_values(). El parámetro que deberemos pasar a este método será o el número del nivel o su nombre -si es que el índice ha recibido nombres-. Por ejemplo, partimos del DataFrame que hemos creado en las secciones anteriores:

In [32]:
index = pd.MultiIndex.from_product(
    [[2018, 2019],["Spain", "Portugal", "France"]],
    names = ["Year", "Country"]
)
data = pd.DataFrame(valores, index = index, columns = ["Sales"])
data

               Sales
Year Country
2018 Spain        18
     Portugal     20
     France       10
2019 Spain        15
     Portugal     12
     France       18

In [33]:
# La columna de etiquetas del multi-índice situada en el extremo izquierdo es la que recibe el número (el índice) 0. Por lo tanto:

print(data.index.get_level_values(0))
print()
print(data.index.get_level_values(1))
print()

Int64Index([2018, 2018, 2018, 2019, 2019, 2019], dtype='int64', name='Year')

Index(['Spain', 'Portugal', 'France', 'Spain', 'Portugal', 'France'], dtype='object', name='Country')

In [34]:
# Si pasamos como argumento el nombre de la columna del índice obtenemos resultados semejantes:
print(data.index.get_level_values("Year"))
print()
print(data.index.get_level_values("Country"))

Int64Index([2018, 2018, 2018, 2019, 2019, 2019], dtype='int64', name='Year')

Index(['Spain', 'Portugal', 'France', 'Spain', 'Portugal', 'France'], dtype='object', name='Country')

Aplicación de funciones estadísticas¶
Usando multi-índices, también es posible aplicar funciones estadísticas al DataFrame o a la Serie especificando el nivel de la jerarquía al que aplicarlas. Por ejemplo, si seguimos trabajando con el mismo DataFrame que hemos visto:

ver https://interactivechaos.com/es/manual/tutorial-de-pandas/aplicacion-de-funciones-estadisticas

In [35]:
data.mean()

Sales    15.5
dtype: float64

Pero si especificamos el nivel al que queremos aplicarlo, el DataFrame se agrega según los valores de dicho nivel antes de realizar la operación. Por ejemplo:

In [36]:
data.mean(level = "Year")

/tmp/ipykernel_11297/326155344.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data.mean(level = "Year")

      Sales
Year
2018   16.0
2019   15.0

## Importante Actualización

In [37]:
data.groupby(level=["Year"]).mean()

      Sales
Year
2018   16.0
2019   15.0

In [38]:
data.groupby(level=["Country"]).mean()

          Sales
Country
France     14.0
Portugal   16.0
Spain      16.5

# LOC

## Con un solo inidce

In [39]:
colum_index = ['Waldon Astling','Augustine Papierz','Lois Vaan']
colum_elemn = ['money','email','id']           

df2.loc[(colum_index,colum_elemn)]

                   money                      email  id
Name
Waldon Astling      1.83  wastling0@dailymail.co.uk   1
Augustine Papierz   0.22    apapierz8@people.com.cn   9
Lois Vaan           1.28            lvaan3@imdb.com   4

In [40]:
df2.loc[colum_index]

,id,email,gender,ip_address,money
Name,,,,,
Waldon Astling,1,wastling0@dailymail.co.uk,Male,188.125.74.119,1.83
Augustine Papierz,9,apapierz8@people.com.cn,Female,43.165.166.247,0.22
Lois Vaan,4,lvaan3@imdb.com,Female,1.196.39.50,1.28

## Multi Index

In [41]:
data.loc[2018]

          Sales
Country
Spain        18
Portugal     20
France       10

In [42]:
data.loc[(2018,'Spain')]

Sales    18
Name: (2018, Spain), dtype: int64

## CASO 2x2

### Multiplex Index Caso de Uso

In [43]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['KAM', 'KAM', 'CC', 'RR'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

          data1     data2
KAM 1  0.437400  0.357846
    2  0.726400  0.875968
CC  1  0.208352  0.356216
RR  2  0.258216  0.853937

In [44]:
df.index

MultiIndex([('KAM', 1),
            ('KAM', 2),
            ( 'CC', 1),
            ( 'RR', 2)],
           )

In [45]:
# hierarchical indices and columns
#index = pd.MultiIndex.from_product([['KAM','CC','DDD'], [1, 2]],
#                                   names=['year', 'visit'])

index = pd.MultiIndex.from_product([['KAM','CC','DDD'], [1, 2],[3],[4,5]])


#columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
#                                     names=['subject', 'type'])

columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     )

# mock some data
data = np.round(np.random.randn(12, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

            Bob       Guido         Sue
             HR  Temp    HR  Temp    HR  Temp
KAM 1 3 4  36.0  37.2  34.0  35.9   9.0  35.7
        5  14.0  36.4  46.0  36.6  31.0  37.8
    2 3 4  28.0  37.3  50.0  38.1  30.0  37.6
        5  56.0  37.1  30.0  35.9  46.0  38.5
CC  1 3 4  26.0  36.3  40.0  38.1  50.0  36.7
        5  35.0  36.3  32.0  38.4  33.0  37.5
    2 3 4  45.0  37.1  50.0  38.9  46.0  36.9
        5  30.0  38.2  43.0  38.6  45.0  36.9
DDD 1 3 4  39.0  37.7  18.0  36.8  46.0  36.3
        5  27.0  37.4  20.0  37.2  46.0  38.5
    2 3 4  38.0  35.0  52.0  37.6  23.0  38.0
        5  41.0  38.2  46.0  36.9  51.0  35.8

In [46]:
health_data.index

MultiIndex([('KAM', 1, 3, 4),
            ('KAM', 1, 3, 5),
            ('KAM', 2, 3, 4),
            ('KAM', 2, 3, 5),
            ( 'CC', 1, 3, 4),
            ( 'CC', 1, 3, 5),
            ( 'CC', 2, 3, 4),
            ( 'CC', 2, 3, 5),
            ('DDD', 1, 3, 4),
            ('DDD', 1, 3, 5),
            ('DDD', 2, 3, 4),
            ('DDD', 2, 3, 5)],
           )

In [47]:
# uso loc para multi niveles del indice

health_data.loc[('KAM',(1,2),3,(5)),['Guido']][:]

          Guido
             HR  Temp
KAM 1 3 5  46.0  36.6
    2 3 5  30.0  35.9

In [48]:
health_data.columns

MultiIndex([(  'Bob',   'HR'),
            (  'Bob', 'Temp'),
            ('Guido',   'HR'),
            ('Guido', 'Temp'),
            (  'Sue',   'HR'),
            (  'Sue', 'Temp')],
           )

In [49]:
# hierarchical indices and columns

import pandas as pd
import numpy as np


# index = pd.MultiIndex.from_product([ [lista para los levels] ])

index = pd.MultiIndex.from_product([
                                    ['KAM','CC','DDD'], #level 0
                                    [1, 2], #level 1
                                    [3],    #level 2 
                                    [4,5],   #level 3
                                    [6,7,8]  #level 4
                                    ,[9]      #level 5
                                    ])


columns = pd.MultiIndex.from_product([
                                      ['a', 'b', 'c'],    #lavel 0
                                      ['aa', 'bb'],       #level 1
                                      ])

# mock some data
data = np.round(np.random.randn(36,6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

                  a           b           c
                 aa    bb    aa    bb    aa    bb
KAM 1 3 4 6 9  41.0  37.2  37.0  36.0  39.0  38.1
          7 9  35.0  37.0  49.0  36.6  54.0  37.0
          8 9  44.0  36.0  57.0  38.5  25.0  37.2
        5 6 9  36.0  35.9  29.0  37.5  30.0  38.2
          7 9  36.0  36.0  50.0  36.6  43.0  36.8
          8 9  18.0  36.5  50.0  37.3  42.0  36.1
    2 3 4 6 9  28.0  38.9  32.0  36.3  34.0  36.9
          7 9  20.0  37.9  13.0  38.4  26.0  38.1
          8 9  37.0  36.7  30.0  36.2  32.0  36.9
        5 6 9  27.0  38.2  31.0  35.9  26.0  36.9
          7 9  46.0  37.0  33.0  37.6  30.0  36.1
          8 9  30.0  36.7  22.0  37.4  46.0  36.6
CC  1 3 4 6 9  19.0  37.5  37.0  38.9  36.0  36.3
          7 9  42.0  35.4  48.0  37.4  40.0  37.1
          8 9  32.0  36.8  29.0  37.5  34.0  36.9
        5 6 9  27.0  37.9  54.0  35.7  44.0  36.9
          7 9  32.0  35.7  54.0  37.7  43.0  36.7
          8 9  35.0  35.9  15.0  38.2  41.0  36.7
    2 3 4 6 9  46.0  38.9  41.0  36.3  52.0  38.6
          7 9  42.0  36.8  36.0  37.6  30.0  37.8
          8 9  36.0  35.1  38.0  36.1  45.0  37.5
        5 6 9  44.0  36.6  46.0  37.1  43.0  36.1
          7 9  36.0  36.0  48.0  37.9  51.0  37.8
          8 9  32.0  35.8  31.0  36.1  38.0  37.6
DDD 1 3 4 6 9  45.0  36.2  43.0  36.8  56.0  39.3
          7 9  33.0  36.3  42.0  35.7  31.0  38.9
          8 9  22.0  39.1  32.0  35.5  33.0  37.4
        5 6 9  36.0  36.5  50.0  36.3  35.0  37.2
          7 9  37.0  36.0  36.0  36.8  23.0  35.2
          8 9  36.0  37.9  25.0  35.9  52.0  36.2
    2 3 4 6 9  28.0  38.0  27.0  36.9  37.0  37.2
          7 9  37.0  37.1  40.0  38.3  33.0  37.4
          8 9  18.0  38.4  23.0  38.3  59.0  37.7
        5 6 9  35.0  37.0  28.0  38.2  50.0  37.5
          7 9  32.0  38.2  28.0  36.6  53.0  36.6
          8 9  32.0  36.4  29.0  37.1  48.0  38.2

In [50]:
# posición usando loc para multiplex index
health_data.loc[('DDD',(2),3,(5),8,9),[('a','bb'),('c','bb')]]

a  bb    36.4
c  bb    38.2
Name: (DDD, 2, 3, 5, 8, 9), dtype: float64

In [51]:
health_data.index.get_level_values(5)

Int64Index([9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9,
            9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9],
           dtype='int64')

In [52]:
health_data.reset_index()

   level_0 level_1 level_2 level_3 level_4 level_5     a           b        \
                                                      aa    bb    aa    bb
0      KAM       1       3       4       6       9  41.0  37.2  37.0  36.0
1      KAM       1       3       4       7       9  35.0  37.0  49.0  36.6
2      KAM       1       3       4       8       9  44.0  36.0  57.0  38.5
3      KAM       1       3       5       6       9  36.0  35.9  29.0  37.5
4      KAM       1       3       5       7       9  36.0  36.0  50.0  36.6
5      KAM       1       3       5       8       9  18.0  36.5  50.0  37.3
6      KAM       2       3       4       6       9  28.0  38.9  32.0  36.3
7      KAM       2       3       4       7       9  20.0  37.9  13.0  38.4
8      KAM       2       3       4       8       9  37.0  36.7  30.0  36.2
9      KAM       2       3       5       6       9  27.0  38.2  31.0  35.9
10     KAM       2       3       5       7       9  46.0  37.0  33.0  37.6
11     KAM       2       3       5       8       9  30.0  36.7  22.0  37.4
12      CC       1       3       4       6       9  19.0  37.5  37.0  38.9
13      CC       1       3       4       7       9  42.0  35.4  48.0  37.4
14      CC       1       3       4       8       9  32.0  36.8  29.0  37.5
15      CC       1       3       5       6       9  27.0  37.9  54.0  35.7
16      CC       1       3       5       7       9  32.0  35.7  54.0  37.7
17      CC       1       3       5       8       9  35.0  35.9  15.0  38.2
18      CC       2       3       4       6       9  46.0  38.9  41.0  36.3
19      CC       2       3       4       7       9  42.0  36.8  36.0  37.6
20      CC       2       3       4       8       9  36.0  35.1  38.0  36.1
21      CC       2       3       5       6       9  44.0  36.6  46.0  37.1
22      CC       2       3       5       7       9  36.0  36.0  48.0  37.9
23      CC       2       3       5       8       9  32.0  35.8  31.0  36.1
24     DDD       1       3       4       6       9  45.0  36.2  43.0  36.8
25     DDD       1       3       4       7       9  33.0  36.3  42.0  35.7
26     DDD       1       3       4       8       9  22.0  39.1  32.0  35.5
27     DDD       1       3       5       6       9  36.0  36.5  50.0  36.3
28     DDD       1       3       5       7       9  37.0  36.0  36.0  36.8
29     DDD       1       3       5       8       9  36.0  37.9  25.0  35.9
30     DDD       2       3       4       6       9  28.0  38.0  27.0  36.9
31     DDD       2       3       4       7       9  37.0  37.1  40.0  38.3
32     DDD       2       3       4       8       9  18.0  38.4  23.0  38.3
33     DDD       2       3       5       6       9  35.0  37.0  28.0  38.2
34     DDD       2       3       5       7       9  32.0  38.2  28.0  36.6
35     DDD       2       3       5       8       9  32.0  36.4  29.0  37.1

       c
      aa    bb
0   39.0  38.1
1   54.0  37.0
2   25.0  37.2
3   30.0  38.2
4   43.0  36.8
5   42.0  36.1
6   34.0  36.9
7   26.0  38.1
8   32.0  36.9
9   26.0  36.9
10  30.0  36.1
11  46.0  36.6
12  36.0  36.3
13  40.0  37.1
14  34.0  36.9
15  44.0  36.9
16  43.0  36.7
17  41.0  36.7
18  52.0  38.6
19  30.0  37.8
20  45.0  37.5
21  43.0  36.1
22  51.0  37.8
23  38.0  37.6
24  56.0  39.3
25  31.0  38.9
26  33.0  37.4
27  35.0  37.2
28  23.0  35.2
29  52.0  36.2
30  37.0  37.2
31  33.0  37.4
32  59.0  37.7
33  50.0  37.5
34  53.0  36.6
35  48.0  38.2

## Aplicación de funciones estadísticas

Usando multi-índices, también es posible aplicar funciones estadísticas al DataFrame o a la Serie especificando el nivel de la jerarquía al que aplicarlas. Por ejemplo, si seguimos trabajando con el mismo DataFrame que hemos visto:

ver https://interactivechaos.com/es/manual/tutorial-de-pandas/aplicacion-de-funciones-estadisticas

# Aplicación de funciones y mapeado

pandas ofrece varios métodos para aplicar funciones a los valores de una serie o de un dataframe, o para sustituir dichos valores por otros aplicando un cierto "mapeado". Más concretamente nos encontramos con los siguientes métodos:

* **pandas.Series.apply:** aplica una función a cada uno de los elementos de la serie cuyo resultado, por lo tanto, tendrá el mismo tamaño que la serie original.

* **pandas.Series.map:** devuelve una serie del mismo tamaño que la original en la que cada valor ha sido sustituido por otro valor resultante de aplicar una "función de mapeado".

* **pandas.Series.agg:** devuelve el resultado de aplicar una o más funciones de agregación a los valores de la serie.


* **pandas.DataFrame.applymap:** aplica una función a cada uno de los elementos del dataframe que, por lo tanto, tendrá el mismo tamaño que el dataframe original.

* **pandas.DataFrame.apply:** aplica una función a las filas o a las columnas de un dataframe. Si, por ejemplo, se aplica a las filas, el resultado será una serie con tantos valores como filas tuviese el dataframe original.


Los nombres pueden parecer un tanto confusos: uno podría esperar que el método apply tuviese el mismo comportamiento en series y en dataframes y, en realidad, el método equivalente al método apply de las series es el applymap de los dataframes.

## El método Series.apply

El método ***pandas.Series.apply*** permite aplicar a cada uno de los elementos de la serie una función. 

Ésta deberá aceptar un único valor como argumento y devolver también un único valor. 

Por ejemplo, si tenemos la siguiente serie:

In [53]:
s = pd.DataFrame(pd.Series([2,5,4]),columns=['Valor'])
s

   Valor
0      2
1      5
2      4

In [54]:
def cubo(n):
    return n**3

In [55]:
cube = lambda x: x**3

In [56]:
s['Cubo']=s.apply(cubo)
s['Cube']=s.Valor.apply(cube)
s

   Valor  Cubo  Cube
0      2     8     8
1      5   125   125
2      4    64    64

## El método Series.map

El método ***pandas.Series.map*** aplicado a una serie s acepta un argumento que indica el tipo de mapeo a realizar y devuelve una serie equivalente a s con sus valores una vez mapeados. Por ejemplo, supongamos que tenemos una serie cuyos valores representan el mes en el que se ha realizado una venta. Por ejemplo:

In [57]:
ventas = pd.DataFrame(pd.Series([1,2,1,1,3,1]), columns=['Numeric_mes'])
ventas

   Numeric_mes
0            1
1            2
2            1
3            1
4            3
5            1

Y supongamos que queremos generar una serie equivalente a ésta en la que cada mes aparezca representado por su nombre, y no por un número. Veamos por separado las opciones de las que disponemos.

In [58]:
meses = {1:"Enero", 2:"Febrero", 3:"Marzo"}
print(meses)

{1: 'Enero', 2: 'Febrero', 3: 'Marzo'}

In [59]:
ventas['Name_Mes'] = ventas.Numeric_mes.map(meses)
ventas

   Numeric_mes Name_Mes
0            1    Enero
1            2  Febrero
2            1    Enero
3            1    Enero
4            3    Marzo
5            1    Enero

## Uso de una serie como función de mapeo

El método también admite como "función de mapeo" una serie:

In [60]:
meses = pd.Series(["Ene","Feb","Mar"],index=[1,2,3])
meses

1    Ene
2    Feb
3    Mar
dtype: object

In [61]:
ventas["Mes_2da_Forma"] = ventas.Numeric_mes.map(meses)
ventas

   Numeric_mes Name_Mes Mes_2da_Forma
0            1    Enero           Ene
1            2  Febrero           Feb
2            1    Enero           Ene
3            1    Enero           Ene
4            3    Marzo           Mar
5            1    Enero           Ene

## Uso de una función como función de mapeo

El tercer método al que podemos recurrir es utilizar una función que acepte como entradas los valores que se encuentren en la serie original y devuelva el resultado del mapeo. Por ejemplo:

In [62]:
def mes_str(n):
  if n == 1:
    return "ENERO"
  elif n == 2:
    return "FEBREO"
  elif n ==3:
    return "MARZO"

In [63]:
ventas['Mes_3ra_Forma']=ventas.Numeric_mes.map(mes_str)
ventas

   Numeric_mes Name_Mes Mes_2da_Forma Mes_3ra_Forma
0            1    Enero           Ene         ENERO
1            2  Febrero           Feb        FEBREO
2            1    Enero           Ene         ENERO
3            1    Enero           Ene         ENERO
4            3    Marzo           Mar         MARZO
5            1    Enero           Ene         ENERO

## El método Series.agg


El método de las series pandas ***pandas.Series.agg*** aplica una o más funciones de agregación a los valores de la serie. La función a aplicar deberá pasarse como primer argumento y tendrá que ser el nombre de una función Python, una cadena de texto representando una función válida o un diccionario. En el caso de querer aplicar más de una función de agregación, éstas deberán pasarse como una lista.

Por ejemplo, consideremos la siguiente serie conteniendo información sobre las ventas realizadas en diferentes meses:

In [64]:
ventas['Ventas'] = [1,3,0,2,5,4]
ventas

   Numeric_mes Name_Mes Mes_2da_Forma Mes_3ra_Forma  Ventas
0            1    Enero           Ene         ENERO       1
1            2  Febrero           Feb        FEBREO       3
2            1    Enero           Ene         ENERO       0
3            1    Enero           Ene         ENERO       2
4            3    Marzo           Mar         MARZO       5
5            1    Enero           Ene         ENERO       4

In [65]:
l = ventas['Ventas'].agg(["mean","max","min","median","std"])
l

mean      2.500000
max       5.000000
min       0.000000
median    2.500000
std       1.870829
Name: Ventas, dtype: float64

## El método DataFrame.apply

Los dataframes tienen un método con el mismo nombre que el método apply de las series, ***pandas.DataFrame.apply***, pero con funcionalidad diferente pues, en el caso de los dataframes, se aplica a lo largo de un eje del dataframe. Esto quiere decir que el argumento de entrada de la función a utilizar no va a ser un simple escalar, sino una serie cuyo índice va a ser el índice de filas del dataframe (si la función se aplica al eje 0) o el índice de columnas del dataframe (si la función se aplica al eje 1). El resultado del método también será una serie que estará formada por los valores calculados.

Por ejemplo, si tenemos el siguiente dataframe con las ventas de los productos A, B, C y D a lo largo de los meses de enero, febrero y marzo:

In [66]:
ventas = pd.DataFrame({"A": [3,3,1],
                       "B": [1,5,2],
                       "C": [3,7,2],
                       "D": [7,2,3]},
                       index = ["Ene","Feb","Mar"]
                      )
ventas

     A  B  C  D
Ene  3  1  3  7
Feb  3  5  7  2
Mar  1  2  2  3

...podríamos estar interesados en calcular el rango en el que se mueven las ventas, es decir, la diferencia entre el mayor y el menor valor de ventas. Para ello, sabiendo que dicho rango se va a aplicar a una fila o a una columna -es decir, a una serie-, definimos la siguiente función:

In [67]:
def rango(s):
    return max(s) - min(s)

Esta función acepta un iterable y devuelve la diferencia entre el valor máximo y el mínimo.

Ahora podemos aplicar esta función a nuestro dataframe de ventas. Por defecto se va a aplicar al eje 0 (eje vertical):

In [68]:
ventas.apply(rango)

A    2
B    4
C    5
D    5
dtype: int64

Si nos fijamos en la columna A, el valor máximo es 3 y el mínimo es 1, de forma que su diferencia es 2, tal y como se muestra en el resultado del método apply.

Si aplicamos el método a lo largo del eje 1 (eje horizontal), obtendremos la diferencia entre el mayor y el menor valor de cada fila:

In [69]:
ventas.apply(rango, axis = 0)

A    2
B    4
C    5
D    5
dtype: int64

## El método DataFrame.applymap

Al contrario de lo que ocurría con el método apply de los dataframes, el método pandas.***DataFrame.applymap*** aplica una función que acepta y devuelve un único escalar, función que se va a aplicar a todos los elementos del dataframe.

Para ver un ejemplo partimos del siguiente dataframe:

In [70]:
ventas

     A  B  C  D
Ene  3  1  3  7
Feb  3  5  7  2
Mar  1  2  2  3

Supongamos que queremos saber si los valores son pares o no. Para ello definimos una función que acepta un valor de entrada y devuelve el booleano True si el valor es par y False en caso contrario:

In [71]:
def par(n):
    if n/2 == n//2:
        return True
    else:
        return False

Ahora podemos aplicar el método añadiendo como argumento esta función:

In [72]:
ventas.applymap(par)

         A      B      C      D
Ene  False  False  False  False
Feb  False  False  False   True
Mar  False   True   True  False

Comprobamos que el resultado es un dataframe del mismo tamaño que el dataframe original en el que cada valor se ha sustituido por el resultado de aplicar la función indicada.



**Nota Importante**

La función asociada con ***applymap()*** se aplica a todos los elementos del DataFrame dado y, por lo tanto, el método ***applymap()*** se define solo para DataFrames. De manera similar, la función asociada con el método **apply()** se puede aplicar a todos los elementos de DataFrame o Series, y por lo tanto, el método ***apply()*** se define para los objetos Series y DataFrame. El método ***map()*** solo se puede definir para objetos Series en Pandas.

## Lambda en Pandas DataFrame con el método apply()

Se me ocurre que podemos aplicar una función Lambda a data cleaning en Pandas con el método apply(), algo que creo nos puede ser de utilidad para evitar crear un bucle que vaya recorriendo todo el DataFrame:

In [73]:
#Importo pandas y numpy para crear un DataFrame
import pandas as pd
import numpy as np

#Creo un DataFrame con dos columnas, Celsius y Kelvin, ambas con datos iguales
data = {'Celsius':[22, 36, 20, 26, 30, 38]}

#Creo el DataFrame con el su index y las columnas Celsius y Kelvin
df = pd.DataFrame(data, index = ['Londres','Madrid','Barcelona','Sevilla','Cádiz','Lima'])


df

           Celsius
Londres         22
Madrid          36
Barcelona       20
Sevilla         26
Cádiz           30
Lima            38

In [74]:
#Aplico la Lambda a la columna [Celcius] con el método apply()
df['Kelvin'] = df.Celsius.apply(lambda x: x + 273,15)
df

           Celsius  Kelvin
Londres         22     295
Madrid          36     309
Barcelona       20     293
Sevilla         26     299
Cádiz           30     303
Lima            38     311